Repository: BFlorry/Instanssi.org
Catalog: Instanssi/kompomaatti/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Request voting rights
fi: Pyydä äänestysoikeudet

source: Save
fi: Tallenna

source: Participate
fi: Osallistu

source: Compo is not active
fi: Kompo ei ole aktiivinen

source: User
fi: Käyttäjä

source: Other contact information
fi: Muut yhteystiedot

source: Other contact information, such as IRC nick.
fi: Muut yhteystiedot, esimerkiksi IRC-nick.

source: profile
fi: profiili

source: profiles
fi: profiilit

source: Name
fi: Nimi

source: Event name
fi: Tapahtuman nimi

source: Date
fi: Päivämäärä

source: Event starting date
fi: Päivämäärä tapahtuman alkamiselle

source: Archived
fi: Arkistoitu

source: Event is visible in archive
fi: Tapahtuma on näkyvissä arkistossa

source: Main page url
fi: Etusivun osoite

source: URL pointing to the event frontpage
fi: Tapahtuman etusivuun osoittava URL

source: event
fi: tapahtuma

source: events
fi: tapahtumaat

source: Event
fi: Tapahtuma

source: Event to request voting rights for
fi: Tapahtuma jolle pyydetään äänestysoikeutta

source: User who made the request
fi: Pyynnön tehnyt käyttäjä

source: Description
fi: Kuvaus

source: Short begging text for the admins
fi: Lyhyt aneluteksti admineille

source: vote code request
fi: äänestyskoodipyyntö

source: vote code requests
fi: äänestyskoodipyynnöt

source: Event with which the vote key is associated with
fi: Tapahtuma, johon äänestysavain on assosioitu

source: User with whom the vote key is associated with
fi: Käyttäjä jolle avain on assosioitu

source: Ticket
fi: Lippu

source: Ticket key which is used as the voting key
fi: Lippu jonka avainta käytetään äänestysavaimena

source: Timestamp
fi: Aikaleima

source: When the user was associated with the key
fi: Aika jolloin avain assosioitiin käyttäjälle

source: ticket vote code
fi: lippuäänestusavain

source: ticket cote codes
fi: lippuäänestusavaimet

source: Key
fi: Avain

source: Vote key
fi: Äänestysavain

source: vote code
fi: äänestyskoodi

source: vote codes
fi: äänestyskoodit

source: Nothing
fi: Ei mitään

source: Youtube first, then image
fi: Ensin Youtube, sitten kuva

source: Image only
fi: Vain kuva

source: (deprecated)
fi: (ei käytössä)

source: Require a separate thumbnail
fi: Vaadi erillinen pikkukuva

source: Use the entryfile as a thumbnail (only works for jpg/png images)
fi: Käytä pikkukuvana teoksen tiedostoa (Toimii vain png/jpg-tiedostoille)

source: Allow thumbnail (not required)
fi: Salli pikkukuva (ei vaadittu)

source: Don't allow thumbnail
fi: Älä salli pikkukuvaa

source: Deadline for adding entries
fi: Deadline entryjen lisäyksille

source: After this, new entries cannot be added. Modifying old entries still works.
fi: Tämän jälkeen kompoon ei voi enää lähettää uusia entryjä. Muokkaus toimii vielä

source: Deadline for editing entries
fi: Deadline entryjen muokkauksille

source: After this, added entries can no longer be edited
fi: Tämän jälkeen entryjen tiedostoja tai muita tietoja ei voi enää muokata

source: Starting time
fi: Alkamisaika

source: Compo starting time (for the event calendar)
fi: Kompon alkamisaika (tapahtumakalenteria varten)

source: Voting start time
fi: Äänestyksen alkamisaika

source: Starting time for voting entries
fi: Alkamisaika entryjen äänestykselle

source: Voting end time
fi: Äänestyksen päättymisaika

source: Ending time for voting entries
fi: Päättymisaika entryjen äänestykselle

source: Size limit for entries
fi: Kokoraja entryille

source: Size limit for entry files (in bytes)
fi: Kokoraja entrytiedostoille (tavua)

source: Size limit for sources
fi: Kokoraja lähdekoodeille

source: Size limit for source files (in bytes)
fi: Kokoraja lähdekooditiedostoille (tavua)

source: Accepted entry file extensions
fi: Sallitut tiedostopäätteet entryille

source: Accepted file extensions for the entry file, separated by vertical bar. Eg. "png|jpg"
fi: Entrypaketille sallitut tiedostopäätteet pystyviivalla eroteltuna, esim. "png|jpg"

source: Accepted source file extensions
fi: Sallitut tiedostopäätteet lähdekoodeille

source: Accepted file extensions for the source file, separated by vertical bar. Eg. "png|jpg"
fi: Lähdekoodipaketille sallitut tiedostopäätteet pystyviivalla eroteltuna, esim. "png|jpg"

source: Accepted image file extensions
fi: Sallitut kuvatiedoston päätteet

source: Accepted file extensions for the image file, separated by vertical bar. Eg. "png|jpg"
fi: Entryn pikkukuvalle sallitut tiedostopäätteet pystyviivalla eroteltuna, esim. "png|jpg"

source: Active
fi: Aktiivinen

source: If the compo is active, it will be visible in kompomaatti
fi: Mikäli kompo on aktiivinen, se näytetään kompomaatissa kaikille

source: Show results
fi: Näytä tulokset

source: Show voting results for this compo
fi: Näytä kompon äänestystulokset

source: Entry preview style
fi: Entryn esikatselun tyyli

source: What kind of entry preview is shown in entry information
fi: Millainen esikatselunäkymä näytetään entryn tiedoissa

source: Hide from archive
fi: Piilota arkistosta

source: Hide compo voting results from the archive (This overrides event settings)
fi: Piilottaa kompon tulokset arkistosta (ohittaa tapahtuman tiedoissa valitun asetuksen)

source: Hide from event page
fi: Piilota tapahtuman etusivulta

source: Hide compo name and description from the event front page (eg. if compo is still a draft)
fi: Piilota kompon nimi ja kuvaus tapahtuman etusivulta (Mikäli kompo on vielä esim. suunnitteluasteella)

source: Is votable
fi: Äänestettävissä

source: Entries can be voted on (disable for eg. robocode)
fi: Teosta voi ylipäätään äänestää (Pois esim. robocodelle)

source: Thumbnail settings
fi: Pikkukuvan asetukset

source: compo
fi: kompo

source: compos
fi: kompot

source: Owner of the entry
fi: Teoksen omistaja

source: Compo
fi: Kompo

source: Entry name
fi: Teoksen nimi

source: Eg. description of techniques and/or tools used.
fi: Kuvaus; esim. käytetyt työkalut ja/tai tekniikat

source: Creator
fi: Tekijä

source: Name of the demogroup or individual
fi: Tekijän tai tekijäryhmän nimi

source: Entry file
fi: Tuotostiedosto

source: Should contain everything required to run/show the entry
fi: Tämän pitää sisältää kaikki mitä tarvitaan tuotoksen näyttämiseen/suorittamiseen

source: Source file
fi: Lähdekooditiedosto

source: Optional source code package
fi: Vapaaehtoinen tuotoksen lähdekoodit sisältävä paketti

source: Image
fi: Kuva

source: Image of the entry (Recommended but not required)
fi: Vapaaehtoinen edustava kuva teokselle

source: URL to the Youtube video of the entry
fi: URL teoksen Youtube-videoon

source: Disqualified
fi: Diskattu

source: Entry is disqualified because of rulebreaking or technical problems(MUST be set before voting starts!)
fi: Entry on diskattu sääntörikon tai teknisten ongelmien takia (ASETETTAVA ENNEN ÄÄNESTYKSEN ALKUA!)

source: Disqualification reason
fi: Diskauksen syy

source: Score
fi: Pisteet

source: Score for the archived entry. If this is not set, the score is automatically calculated from votes.
fi: Entryn saamat pisteet. Mikäli tätä ei ole asetettu, lasketaan pisteet suoraan annetuista äänistä.

source: Rank
fi: Sijoitus

source: Rank for the archived entry. If this is not set, the rank is automatically calculated from scores.
fi: Entryn sijoitus. Mikäli tätä ei ole asetettu, lasketaan sijoitus suoraan entryjen pisteistä.

source: entry
fi: tuotos

source: entries
fi: tuotokset

source: Entry
fi: Tuotos

source: {entry} by {username} as {rank}
fi: Tekijän {username} teos {entry} sijoitus on {rank}

source: vote
fi: ääni

source: votes
fi: äänet

source: Highest result first
fi: Korkein tulos ensin

source: Lowest result first
fi: Matalin tulos ensin

source: Sports competition name
fi: Urheilukilpailun nimi

source: Participation deadline time
fi: Osallistumisen takaraja

source: Competition start time
fi: Kilpailun alkuaika

source: Competition ending time
fi: Kilpailun päättymisaika

source: Score type
fi: Pisteiden tyyppi

source: Score type, eg. "km", "m", "sec" etc.
fi: Pisteiden tyyppi, esim. "km", "m", "sek" jne.

source: Score sorting
fi: Pisteiden järjestely

source: Whether the winner be decided by highest or the lowest score
fi: Onko voittaja suurimman vai pienimmän pistemäärän saavuttanut

source: Show competition results
fi: Näytä kilpailun tulokset

source: If the competition is active, it will be visible in kompomaatti
fi: Mikäli kilpailu on aktiivinen, se näytetään kompomaatissa kaikille

source: Hide competition results from the archive (This overrides event settings)
fi: Piilottaa kilpailun tulokset arkistosta (ohittaa tapahtuman tiedoissa valitun asetuksen)

source: competition
fi: kilpailu

source: competitions
fi: kilpailut

source: Competition
fi: Kilpailu

source: Participant nickname
fi: Osallistujan nimimerkki

source: Nickname with which to participate
fi: Nimimerkki jolla osallistutaan

source: Score achieved by participant
fi: Kilpailijan saavuttamat pisteet

source: Participant is disqualified for some reason
fi: Kilpailija on diskattu syystä tai toisesta

source: participation
fi: Osallistuminen

source: participations
fi: Osallistumiset
